[
  {
    "id": 1,
    "tmdbId": 85315,
    "title": "Смешарики: Начало",
    "year": 2011,
    "genre": [
      "мультфильм",
      "семейный",
      "комедия"
    ],
    "description": "Такую экстремальную историю про Смешариков вы не могли себе представить: покинув свою уютную страну, Смешарики оказываются в современном мегаполисе в роли супергероев! Зачем? Они приняли очень важное для себя решение — спасти мир от нависшей угрозы. Этот «ответственный» шаг приводит к самому захватывающему приключению в их жизни!",
    "rating": 6.4,
    "poster": "https://image.tmdb.org/t/p/w500/qIgvq1WpH7ZlzLIA9rnosMwqA69.jpg",
    "youtubeId": "kZzqQWPw1Og"
  },
  {
    "id": 2,
    "tmdbId": 377883,
    "title": "Смешарики. Легенда о золотом драконе",
    "year": 2016,
    "genre": [
      "мультфильм",
      "семейный"
    ],
    "description": "Выдающийся учёный и его команда отправляются в самое сердце диких джунглей, где их ждут опасные приключения, свирепые туземцы и расхитители гробниц, до зубов вооруженные гаджетами.",
    "rating": 5.933,
    "poster": "https://image.tmdb.org/t/p/w500/djpx4XhkhHQmiHNMJGmH4HAdKdU.jpg",
    "youtubeId": "SIYO2v3-gv4"
  },
  {
    "id": 3,
    "tmdbId": 506752,
    "title": "Смешарики: Дежавю",
    "year": 2018,
    "genre": [
      "мультфильм",
      "семейный",
      "комедия"
    ],
    "description": "Крош решает устроить незабываемый день рождения Копатыча — он обращается в агентство «Дежавю», которое обещает своим клиентам удивительные путешествия во времени. Но из-за несоблюдения условий договора всех смешариков раскидывает во времени, а Крошу придется собирать друзей по разным эпохам в компании своего второго «Я» — повзрослевшего и ворчливого Шорка, появившегося из-за временного парадокса.",
    "rating": 6.9,
    "poster": "https://image.tmdb.org/t/p/w500/tZnCvsKEVKsIMW69BTcQm5EJsb3.jpg",
    "youtubeId": "d8OiZIFtSNY"
  },
  {
    "id": 4,
    "tmdbId": 552524,
    "title": "Лило и Стич",
    "year": 2025,
    "genre": [
      "семейный",
      "комедия",
      "фантастика",
      "приключения"
    ],
    "description": "История маленькой девочки, живущей на Гавайах, и замаскированного инопланетянина, который помогает ей спасти свою разрушенную семью.",
    "rating": 7.125,
    "poster": "https://image.tmdb.org/t/p/w500/bRB9ApGPhY7NtUQ33yZG828rbus.jpg",
    "youtubeId": null
  },
  {
    "id": 5,
    "tmdbId": 950387,
    "title": "Minecraft в Кино",
    "year": 2025,
    "genre": [
      "семейный",
      "комедия",
      "приключения",
      "фэнтези"
    ],
    "description": "Четыре неудачника — Гарретт «Мусорщик» Гаррисон, Генри, Натали и Дон, сталкиваются с обычными проблемами, когда их внезапно затягивает через таинственный портал в Верхний мир: странную кубическую страну чудес, которая процветает благодаря воображению. Чтобы вернуться домой, им придётся освоить этот мир, отправляясь в магическое путешествие с неожиданным экспертом-ремесленником Стивом. Это приключение бросит вызов всем пятерым, заставит их проявить смелость и восстановить качества, которые делают каждого из них уникальным творческим человеком.",
    "rating": 6.5,
    "poster": "https://image.tmdb.org/t/p/w500/3txl2FUNZCQUnHQPzkuNc17yLIs.jpg",
    "youtubeId": null
  },
  {
    "id": 6,
    "tmdbId": 263115,
    "title": "Логан",
    "year": 2017,
    "genre": [
      "боевик",
      "драма",
      "фантастика"
    ],
    "description": "В недалеком будущем уставший от жизни Логан заботится о больном профессоре Икс, который прячется неподалеку от мексиканской границы. Но Логан больше не сможет скрывать свое прошлое, когда встретится с юным мутантом, которого преследуют темные силы.",
    "rating": 7.82,
    "poster": "https://image.tmdb.org/t/p/w500/6FSoZ8mtEwPAO3k670G3yRaBpTK.jpg",
    "youtubeId": "h3-TVvwMb-I"
  },
  {
    "id": 7,
    "tmdbId": 333339,
    "title": "Первому игроку приготовиться",
    "year": 2018,
    "genre": [
      "приключения",
      "боевик",
      "фантастика"
    ],
    "description": "Действие фильма происходит в 2045 году, мир погружается в хаос и находится на грани коллапса. Люди ищут спасения в игре OASIS — огромной вселенной виртуальной реальности. Ее создатель, гениальный и эксцентричный Джеймс Холлидэй, оставляет уникальное завещание. Все его колоссальное состояние получит игрок, первым обнаруживший цифровое «пасхальное яйцо», которое миллиардер спрятал где-то на просторах OASISа. Запущенный им квест охватывает весь мир. Совершенно негероический парень по имени Уэйд Уоттс решает принять участие в состязании, с головой бросаясь в головокружительную, искажающую реальность погоню за сокровищами по фантастической вселенной, полной загадок, открытий и опасностей.",
    "rating": 7.589,
    "poster": "https://image.tmdb.org/t/p/w500/eVvMjpcw2lkS1A7hTeOzZDk0Ocf.jpg"
  },
  {
    "id": 8,
    "tmdbId": 129,
    "title": "Унесённые призраками",
    "year": 2001,
    "genre": [
      "мультфильм",
      "семейный",
      "фэнтези"
    ],
    "description": "Тихиро с мамой и папой переезжает в новый дом. Заблудившись по дороге, они оказываются в странном пустынном городе, где их ждет великолепный пир. Родители с жадностью набрасываются на еду и к ужасу девочки превращаются в свиней, став пленниками злой колдуньи Юбабы. Теперь, оказавшись одна среди волшебных существ и загадочных видений, Тихиро должна придумать, как избавить своих родителей от чар коварной старухи.",
    "rating": 8.537,
    "poster": "https://image.tmdb.org/t/p/w500/xV3zYcOA6xFjYwizIMDDkl2MGT7.jpg",
    "youtubeId": "Wlq6vnge20U"
  },
  {
    "id": 9,
    "tmdbId": 372058,
    "title": "Твоё имя",
    "year": 2016,
    "genre": [
      "мультфильм",
      "мелодрама",
      "драма"
    ],
    "description": "Токийский парень Таки и провинциальная девушка Мицуха обнаруживают, что между ними существует странная связь. Во сне они меняются телами и проживают жизни друг друга. Но однажды эта способность исчезает так же внезапно, как появилась. Таки решает во что бы то ни стало отыскать Мицуху.",
    "rating": 8.482,
    "poster": "https://image.tmdb.org/t/p/w500/iH2WDCYLIUjc7oPWRT7Kxgxza6k.jpg",
    "youtubeId": "qtJ7B08mUFE"
  },
  {
    "id": 10,
    "tmdbId": 278,
    "title": "Побег из Шоушенка",
    "year": 1994,
    "genre": [
      "драма",
      "криминал"
    ],
    "description": "Бухгалтер Энди Дюфрейн обвинён в убийстве собственной жены и её любовника. Оказавшись в тюрьме под названием Шоушенк, он сталкивается с жестокостью и беззаконием, царящими по обе стороны решётки. Каждый, кто попадает в эти стены, становится их рабом до конца жизни. Но Энди, обладающий живым умом и доброй душой, находит подход как к заключённым, так и к охранникам, добиваясь их особого к себе расположения.",
    "rating": 8.711,
    "poster": "https://image.tmdb.org/t/p/w500/yvmKPlTIi0xdcFQIFcQKQJcI63W.jpg",
    "youtubeId": "kgAeKpAPOYk"
  },
  {
    "id": 11,
    "tmdbId": 157336,
    "title": "Интерстеллар",
    "year": 2014,
    "genre": [
      "приключения",
      "драма",
      "фантастика"
    ],
    "description": "Когда засуха, пыльные бури и вымирание растений приводят человечество к продовольственному кризису, коллектив исследователей и учёных отправляется сквозь червоточину (которая предположительно соединяет области пространства-времени через большое расстояние) в путешествие, чтобы превзойти прежние ограничения для космических путешествий человека и найти планету с подходящими для человечества условиями.",
    "rating": 8.455,
    "poster": "https://image.tmdb.org/t/p/w500/vReLRjDV9XPhiOSEW7QWow4DXwf.jpg",
    "youtubeId": "qcPfI0y7wRU"
  },
  {
    "id": 12,
    "tmdbId": 502356,
    "title": "Братья Супер Марио в кино",
    "year": 2023,
    "genre": [
      "семейный",
      "комедия",
      "приключения",
      "мультфильм"
    ],
    "description": "Анимационный фильм, основанный на компьютерной игре Super Mario Bros. Работая под землей над ремонтом водопровода, бруклинские сантехники — братья Марио и Луиджи — спускаются по таинственной трубе и попадают в волшебный новый мир. Но когда братья разлучаются, Марио отправляется в эпическое путешествие, чтобы найти Луиджи.",
    "rating": 7.62,
    "poster": "https://image.tmdb.org/t/p/w500/p8iYoIEW7fPlOWtMIbB7GoKFgyy.jpg"
  }
]